## [ 접근자 Accessor ]
- Series/DataFrame의 데이터가 날짜시간(datetime), 문자열(object), 범주형(category) 등의 경우 데이터 타입과 관련된 정용의 함수들을 사용할 수 있도록 해주는 속성
- Series.str.문자열처리관련함수명( )   
- Series.dt.날짜시간처리관련속성명

(1) 모듈 로딩

In [332]:
import pandas as pd

(2) 데이터 준비

In [333]:
datas = {'name':['홍 길동', '이 나영', '마 징가', '베 토벤'], 
         'age':[10, 21, 73, 89], 
         'reg_date': ['2000/01/23', '2020/11/08', '1999/5/4', '1987/12/24']}

datas2 = [['홍 길동', '이 나영', '마 징가', '베 토벤'], 
         [10, 21, 73, 89], 
         ['2000/01/23', '2020/11/08', '1999/5/4', '1987/12/24']]

(3) 데이터 저장

In [334]:
# Dict ==> DataFrame
df1 = pd.DataFrame(datas)
df1
#키가 컬럼명이 됨

   name  age    reg_date
0  홍 길동   10  2000/01/23
1  이 나영   21  2020/11/08
2  마 징가   73    1999/5/4
3  베 토벤   89  1987/12/24

In [335]:
# List ==> DataFrame
df1 = pd.DataFrame(datas2)
df1
# 리스트 1개가 1개의 행이 됨

            0           1         2           3
0        홍 길동        이 나영      마 징가        베 토벤
1          10          21        73          89
2  2000/01/23  2020/11/08  1999/5/4  1987/12/24

(4) 데이터 정보 확인

In [336]:
# 데이터의 전체 기본 정보 => info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      object
 2   2       3 non-null      object
 3   3       3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

(5) 데이터 전처리

- (5-1) 행 <=> 열 치환

In [337]:
df1.T

      0   1           2
0  홍 길동  10  2000/01/23
1  이 나영  21  2020/11/08
2  마 징가  73    1999/5/4
3  베 토벤  89  1987/12/24

In [338]:
df1 = df1.transpose()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      object
 1   1       4 non-null      object
 2   2       4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

- (5-2) 실제 데이터와 타입 확인 후 형변환

In [339]:
df1.head()

      0   1           2
0  홍 길동  10  2000/01/23
1  이 나영  21  2020/11/08
2  마 징가  73    1999/5/4
3  베 토벤  89  1987/12/24

In [340]:
# 1번 컬럼 : object => 정수
df1[1] = df1[1].astype('uint8')

# 부호가 없음 => unsigned
# uint8 => 부호가 없음 + int + 1바이트

In [341]:
df1.dtypes          #타입만 확인하려면 ㅇㅇ

0    object
1     uint8
2    object
dtype: object

In [342]:
# 2번 컬럼 : object => datetime64[ns]
df1[2] = df1[2].astype('datetime64[ns]')

In [343]:
df1.dtypes

0            object
1             uint8
2    datetime64[ns]
dtype: object

- (5-3) 0번 컬럼의 이름을 성과 이름으로 분리

In [344]:
# 0번 컬럼만 추출
nameSR = df1[0]               #시리즈로 뽑힌 하나의 열
nameSR, nameSR[1]             #그 시리즈에서 1번 인덱스의 값을 추출

(0    홍 길동
 1    이 나영
 2    마 징가
 3    베 토벤
 Name: 0, dtype: object,
 '이 나영')

In [345]:
# '이 나영' 데이터를 추출 => 성과 이름으로 분리
nameSR[1].split()          #split을 기본은 공백으로 나누는 것

['이', '나영']

In [346]:
#for idx in range(nameSR.shape[0]):
    #nameSR[idx] = nameSR[idx].split()

#nameSR

#여기서 또 성과 이름을 따로 뽑으려면 반복문 써야함. 그걸 또 열을 새로 만들어서 넣어주어야 함
#그대신에 아래와 같이 한다.

In [347]:
namesDF = nameSR.str.split(expand = True)

In [348]:
df1, namesDF

(      0   1          2
 0  홍 길동  10 2000-01-23
 1  이 나영  21 2020-11-08
 2  마 징가  73 1999-05-04
 3  베 토벤  89 1987-12-24,
    0   1
 0  홍  길동
 1  이  나영
 2  마  징가
 3  베  토벤)

- (5-4) 두개의 DataFrame을 컬럼 방향으로 연결

In [349]:
# test1 = pd.concat([df1, namesDF])
# test1.reset_index(drop=True)
# 2번열이 날짜엿음 그래서 NaT (Not a Timestamp)
#reset_index에서 drop하면 새롭게 지정된 인덱스 번호가 사라짐

#pd.concat([df1, namesDF], axis = 'columns', ignore_index = True)
#기준을 열로 잡아서 열로 넣어진 상태로 추출됨
#열 인덱스는 무시하고 새롭게 번호가 붙여짐

- {5-5) 2번 컬럼에서 년, 월, 일을 분리

In [350]:
df1[2]

0   2000-01-23
1   2020-11-08
2   1999-05-04
3   1987-12-24
Name: 2, dtype: datetime64[ns]

In [351]:
yearSR = df1[2].dt.year

In [352]:
monthSR = df1[2].dt.month

In [353]:
daySR = df1[2].dt.day

In [354]:
pd.concat([df1, yearSR, monthSR, daySR], axis = 1, ignore_index = True)

      0   1          2     3   4   5
0  홍 길동  10 2000-01-23  2000   1  23
1  이 나영  21 2020-11-08  2020  11   8
2  마 징가  73 1999-05-04  1999   5   4
3  베 토벤  89 1987-12-24  1987  12  24

- (5-6) 현재 DataFrame을 파일로 저장하기 => pandas.to_XXX("파일경로 + 파일명")

In [355]:
# CSV ==> 데이터와 데이터의 구분자
filename = "./backup.csv"         # "backup.csv"

In [356]:
df1.to_csv(filename, sep = ' ', header = False, index = False)

In [357]:
pd.read_csv(filename, header = None,  sep = ' ')

      0   1           2
0  홍 길동  10  2000-01-23
1  이 나영  21  2020-11-08
2  마 징가  73  1999-05-04
3  베 토벤  89  1987-12-24